apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_sens.h
/****************************************************************************
 * arch/xtensa/src/esp32/hardware/esp32_sens.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_SENS_H
#define __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_SENS_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* SENS_SAR_READ_CTRL_REG register */

#define SENS_SAR_READ_CTRL_REG (DR_REG_SENS_BASE + 0x0)

/* SENS_SAR1_DATA_INV : RW; bitpos: [28]; default: 0;
 * Invert SAR ADC1 data
 */

#define SENS_SAR1_DATA_INV    (BIT(28))
#define SENS_SAR1_DATA_INV_M  (SENS_SAR1_DATA_INV_V << SENS_SAR1_DATA_INV_S)
#define SENS_SAR1_DATA_INV_V  0x00000001
#define SENS_SAR1_DATA_INV_S  28

/* SENS_SAR1_DIG_FORCE : RW; bitpos: [27]; default: 0;
 * 1: SAR ADC1 controlled by DIG ADC1 CTRL  0: SAR ADC1 controlled by RTC
 * ADC1 CTRL
 */

#define SENS_SAR1_DIG_FORCE    (BIT(27))
#define SENS_SAR1_DIG_FORCE_M  (SENS_SAR1_DIG_FORCE_V << SENS_SAR1_DIG_FORCE_S)
#define SENS_SAR1_DIG_FORCE_V  0x00000001
#define SENS_SAR1_DIG_FORCE_S  27

/* SENS_SAR1_SAMPLE_NUM : RW; bitpos: [26:19]; default: 0; */

#define SENS_SAR1_SAMPLE_NUM    0x000000ff
#define SENS_SAR1_SAMPLE_NUM_M  (SENS_SAR1_SAMPLE_NUM_V << SENS_SAR1_SAMPLE_NUM_S)
#define SENS_SAR1_SAMPLE_NUM_V  0x000000ff
#define SENS_SAR1_SAMPLE_NUM_S  19

/* SENS_SAR1_CLK_GATED : RW; bitpos: [18]; default: 1; */

#define SENS_SAR1_CLK_GATED    (BIT(18))
#define SENS_SAR1_CLK_GATED_M  (SENS_SAR1_CLK_GATED_V << SENS_SAR1_CLK_GATED_S)
#define SENS_SAR1_CLK_GATED_V  0x00000001
#define SENS_SAR1_CLK_GATED_S  18

/* SENS_SAR1_SAMPLE_BIT : RW; bitpos: [17:16]; default: 3;
 * 00: for 9-bit width  01: for 10-bit width  10: for 11-bit width  11: for
 * 12-bit width
 */

#define SENS_SAR1_SAMPLE_BIT    0x00000003
#define SENS_SAR1_SAMPLE_BIT_M  (SENS_SAR1_SAMPLE_BIT_V << SENS_SAR1_SAMPLE_BIT_S)
#define SENS_SAR1_SAMPLE_BIT_V  0x00000003
#define SENS_SAR1_SAMPLE_BIT_S  16

/* SENS_SAR1_SAMPLE_CYCLE : RW; bitpos: [15:8]; default: 9;
 * sample cycles for SAR ADC1
 */

#define SENS_SAR1_SAMPLE_CYCLE    0x000000ff
#define SENS_SAR1_SAMPLE_CYCLE_M  (SENS_SAR1_SAMPLE_CYCLE_V << SENS_SAR1_SAMPLE_CYCLE_S)
#define SENS_SAR1_SAMPLE_CYCLE_V  0x000000ff
#define SENS_SAR1_SAMPLE_CYCLE_S  8

/* SENS_SAR1_CLK_DIV : RW; bitpos: [7:0]; default: 2;
 * clock divider
 */

#define SENS_SAR1_CLK_DIV    0x000000ff
#define SENS_SAR1_CLK_DIV_M  (SENS_SAR1_CLK_DIV_V << SENS_SAR1_CLK_DIV_S)
#define SENS_SAR1_CLK_DIV_V  0x000000ff
#define SENS_SAR1_CLK_DIV_S  0

/* SENS_SAR_READ_STATUS1_REG register */

#define SENS_SAR_READ_STATUS1_REG (DR_REG_SENS_BASE + 0x4)

/* SENS_SAR1_READER_STATUS : R; bitpos: [31:0]; default: 0; */

#define SENS_SAR1_READER_STATUS    0xffffffff
#define SENS_SAR1_READER_STATUS_M  (SENS_SAR1_READER_STATUS_V << SENS_SAR1_READER_STATUS_S)
#define SENS_SAR1_READER_STATUS_V  0xffffffff
#define SENS_SAR1_READER_STATUS_S  0

/* SENS_SAR_MEAS_WAIT1_REG register */

#define SENS_SAR_MEAS_WAIT1_REG (DR_REG_SENS_BASE + 0x8)

/* SENS_SAR_AMP_WAIT2 : RW; bitpos: [31:16]; default: 10; */

#define SENS_SAR_AMP_WAIT2    0x0000ffff
#define SENS_SAR_AMP_WAIT2_M  (SENS_SAR_AMP_WAIT2_V << SENS_SAR_AMP_WAIT2_S)
#define SENS_SAR_AMP_WAIT2_V  0x0000ffff
#define SENS_SAR_AMP_WAIT2_S  16

/* SENS_SAR_AMP_WAIT1 : RW; bitpos: [15:0]; default: 10; */

#define SENS_SAR_AMP_WAIT1    0x0000ffff
#define SENS_SAR_AMP_WAIT1_M  (SENS_SAR_AMP_WAIT1_V << SENS_SAR_AMP_WAIT1_S)
#define SENS_SAR_AMP_WAIT1_V  0x0000ffff
#define SENS_SAR_AMP_WAIT1_S  0

/* SENS_SAR_MEAS_WAIT2_REG register */

#define SENS_SAR_MEAS_WAIT2_REG (DR_REG_SENS_BASE + 0xc)

/* SENS_SAR2_RSTB_WAIT : RW; bitpos: [27:20]; default: 2; */

#define SENS_SAR2_RSTB_WAIT    0x000000ff
#define SENS_SAR2_RSTB_WAIT_M  (SENS_SAR2_RSTB_WAIT_V << SENS_SAR2_RSTB_WAIT_S)
#define SENS_SAR2_RSTB_WAIT_V  0x000000ff
#define SENS_SAR2_RSTB_WAIT_S  20

/* SENS_FORCE_XPD_SAR : RW; bitpos: [19:18]; default: 0; */

#define SENS_FORCE_XPD_SAR    0x00000003
#define SENS_FORCE_XPD_SAR_M  (SENS_FORCE_XPD_SAR_V << SENS_FORCE_XPD_SAR_S)
#define SENS_FORCE_XPD_SAR_V  0x00000003
#define SENS_FORCE_XPD_SAR_S  18

/* SENS_FORCE_XPD_AMP : RW; bitpos: [17:16]; default: 0; */

#define SENS_FORCE_XPD_AMP    0x00000003
#define SENS_FORCE_XPD_AMP_M  (SENS_FORCE_XPD_AMP_V << SENS_FORCE_XPD_AMP_S)
#define SENS_FORCE_XPD_AMP_V  0x00000003
#define SENS_FORCE_XPD_AMP_S  16

/* SENS_SAR_AMP_WAIT3 : RW; bitpos: [15:0]; default: 10; */

#define SENS_SAR_AMP_WAIT3    0x0000ffff
#define SENS_SAR_AMP_WAIT3_M  (SENS_SAR_AMP_WAIT3_V << SENS_SAR_AMP_WAIT3_S)
#define SENS_SAR_AMP_WAIT3_V  0x0000ffff
#define SENS_SAR_AMP_WAIT3_S  0

/* SENS_FORCE_XPD_SAR_SW : RW; bitpos: [-1:0]; default: 0; */

#define SENS_FORCE_XPD_SAR_SW    0x00000000
#define SENS_FORCE_XPD_SAR_SW_M  (SENS_FORCE_XPD_SAR_SW_V << SENS_FORCE_XPD_SAR_SW_S)
#define SENS_FORCE_XPD_SAR_SW_V  0x00000000
#define SENS_FORCE_XPD_SAR_SW_S  0

/* SENS_SAR_MEAS_CTRL_REG register */

#define SENS_SAR_MEAS_CTRL_REG (DR_REG_SENS_BASE + 0x10)

/* SENS_SAR2_XPD_WAIT : RW; bitpos: [31:24]; default: 7; */

#define SENS_SAR2_XPD_WAIT    0x000000ff
#define SENS_SAR2_XPD_WAIT_M  (SENS_SAR2_XPD_WAIT_V << SENS_SAR2_XPD_WAIT_S)
#define SENS_SAR2_XPD_WAIT_V  0x000000ff
#define SENS_SAR2_XPD_WAIT_S  24

/* SENS_SAR_RSTB_FSM : RW; bitpos: [23:20]; default: 0; */

#define SENS_SAR_RSTB_FSM    0x0000000f
#define SENS_SAR_RSTB_FSM_M  (SENS_SAR_RSTB_FSM_V << SENS_SAR_RSTB_FSM_S)
#define SENS_SAR_RSTB_FSM_V  0x0000000f
#define SENS_SAR_RSTB_FSM_S  20

