apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_sens.h
/* SENS_XPD_SAR_FSM : RW; bitpos: [19:16]; default: 7; */

#define SENS_XPD_SAR_FSM    0x0000000f
#define SENS_XPD_SAR_FSM_M  (SENS_XPD_SAR_FSM_V << SENS_XPD_SAR_FSM_S)
#define SENS_XPD_SAR_FSM_V  0x0000000f
#define SENS_XPD_SAR_FSM_S  16

/* SENS_AMP_SHORT_REF_GND_FSM : RW; bitpos: [15:12]; default: 3; */

#define SENS_AMP_SHORT_REF_GND_FSM    0x0000000f
#define SENS_AMP_SHORT_REF_GND_FSM_M  (SENS_AMP_SHORT_REF_GND_FSM_V << SENS_AMP_SHORT_REF_GND_FSM_S)
#define SENS_AMP_SHORT_REF_GND_FSM_V  0x0000000f
#define SENS_AMP_SHORT_REF_GND_FSM_S  12

/* SENS_AMP_SHORT_REF_FSM : RW; bitpos: [11:8]; default: 3; */

#define SENS_AMP_SHORT_REF_FSM    0x0000000f
#define SENS_AMP_SHORT_REF_FSM_M  (SENS_AMP_SHORT_REF_FSM_V << SENS_AMP_SHORT_REF_FSM_S)
#define SENS_AMP_SHORT_REF_FSM_V  0x0000000f
#define SENS_AMP_SHORT_REF_FSM_S  8

/* SENS_AMP_RST_FB_FSM : RW; bitpos: [7:4]; default: 8; */

#define SENS_AMP_RST_FB_FSM    0x0000000f
#define SENS_AMP_RST_FB_FSM_M  (SENS_AMP_RST_FB_FSM_V << SENS_AMP_RST_FB_FSM_S)
#define SENS_AMP_RST_FB_FSM_V  0x0000000f
#define SENS_AMP_RST_FB_FSM_S  4

/* SENS_XPD_SAR_AMP_FSM : RW; bitpos: [3:0]; default: 15; */

#define SENS_XPD_SAR_AMP_FSM    0x0000000f
#define SENS_XPD_SAR_AMP_FSM_M  (SENS_XPD_SAR_AMP_FSM_V << SENS_XPD_SAR_AMP_FSM_S)
#define SENS_XPD_SAR_AMP_FSM_V  0x0000000f
#define SENS_XPD_SAR_AMP_FSM_S  0

/* SENS_SAR_READ_STATUS2_REG register */

#define SENS_SAR_READ_STATUS2_REG (DR_REG_SENS_BASE + 0x14)

/* SENS_SAR2_READER_STATUS : R; bitpos: [31:0]; default: 0; */

#define SENS_SAR2_READER_STATUS    0xffffffff
#define SENS_SAR2_READER_STATUS_M  (SENS_SAR2_READER_STATUS_V << SENS_SAR2_READER_STATUS_S)
#define SENS_SAR2_READER_STATUS_V  0xffffffff
#define SENS_SAR2_READER_STATUS_S  0

/* SENS_ULP_CP_SLEEP_CYC0_REG register */

#define SENS_ULP_CP_SLEEP_CYC0_REG (DR_REG_SENS_BASE + 0x18)

/* SENS_SLEEP_CYCLES_S0 : RW; bitpos: [31:0]; default: 200;
 * sleep cycles for ULP-coprocessor timer
 */

#define SENS_SLEEP_CYCLES_S0    0xffffffff
#define SENS_SLEEP_CYCLES_S0_M  (SENS_SLEEP_CYCLES_S0_V << SENS_SLEEP_CYCLES_S0_S)
#define SENS_SLEEP_CYCLES_S0_V  0xffffffff
#define SENS_SLEEP_CYCLES_S0_S  0

/* SENS_ULP_CP_SLEEP_CYC1_REG register */

#define SENS_ULP_CP_SLEEP_CYC1_REG (DR_REG_SENS_BASE + 0x1c)

/* SENS_SLEEP_CYCLES_S1 : RW; bitpos: [31:0]; default: 100; */

#define SENS_SLEEP_CYCLES_S1    0xffffffff
#define SENS_SLEEP_CYCLES_S1_M  (SENS_SLEEP_CYCLES_S1_V << SENS_SLEEP_CYCLES_S1_S)
#define SENS_SLEEP_CYCLES_S1_V  0xffffffff
#define SENS_SLEEP_CYCLES_S1_S  0

/* SENS_ULP_CP_SLEEP_CYC2_REG register */

#define SENS_ULP_CP_SLEEP_CYC2_REG (DR_REG_SENS_BASE + 0x20)

/* SENS_SLEEP_CYCLES_S2 : RW; bitpos: [31:0]; default: 50; */

#define SENS_SLEEP_CYCLES_S2    0xffffffff
#define SENS_SLEEP_CYCLES_S2_M  (SENS_SLEEP_CYCLES_S2_V << SENS_SLEEP_CYCLES_S2_S)
#define SENS_SLEEP_CYCLES_S2_V  0xffffffff
#define SENS_SLEEP_CYCLES_S2_S  0

/* SENS_ULP_CP_SLEEP_CYC3_REG register */

#define SENS_ULP_CP_SLEEP_CYC3_REG (DR_REG_SENS_BASE + 0x24)

/* SENS_SLEEP_CYCLES_S3 : RW; bitpos: [31:0]; default: 40; */

#define SENS_SLEEP_CYCLES_S3    0xffffffff
#define SENS_SLEEP_CYCLES_S3_M  (SENS_SLEEP_CYCLES_S3_V << SENS_SLEEP_CYCLES_S3_S)
#define SENS_SLEEP_CYCLES_S3_V  0xffffffff
#define SENS_SLEEP_CYCLES_S3_S  0

/* SENS_ULP_CP_SLEEP_CYC4_REG register */

#define SENS_ULP_CP_SLEEP_CYC4_REG (DR_REG_SENS_BASE + 0x28)

/* SENS_SLEEP_CYCLES_S4 : RW; bitpos: [31:0]; default: 20; */

#define SENS_SLEEP_CYCLES_S4    0xffffffff
#define SENS_SLEEP_CYCLES_S4_M  (SENS_SLEEP_CYCLES_S4_V << SENS_SLEEP_CYCLES_S4_S)
#define SENS_SLEEP_CYCLES_S4_V  0xffffffff
#define SENS_SLEEP_CYCLES_S4_S  0

/* SENS_SAR_START_FORCE_REG register */

#define SENS_SAR_START_FORCE_REG (DR_REG_SENS_BASE + 0x2c)

/* SENS_SAR2_PWDET_EN : RW; bitpos: [24]; default: 0;
 * N/A
 */

#define SENS_SAR2_PWDET_EN    (BIT(24))
#define SENS_SAR2_PWDET_EN_M  (SENS_SAR2_PWDET_EN_V << SENS_SAR2_PWDET_EN_S)
#define SENS_SAR2_PWDET_EN_V  0x00000001
#define SENS_SAR2_PWDET_EN_S  24

/* SENS_SAR1_STOP : RW; bitpos: [23]; default: 0;
 * stop SAR ADC1 conversion
 */

#define SENS_SAR1_STOP    (BIT(23))
#define SENS_SAR1_STOP_M  (SENS_SAR1_STOP_V << SENS_SAR1_STOP_S)
#define SENS_SAR1_STOP_V  0x00000001
#define SENS_SAR1_STOP_S  23

/* SENS_SAR2_STOP : RW; bitpos: [22]; default: 0;
 * stop SAR ADC2 conversion
 */

#define SENS_SAR2_STOP    (BIT(22))
#define SENS_SAR2_STOP_M  (SENS_SAR2_STOP_V << SENS_SAR2_STOP_S)
#define SENS_SAR2_STOP_V  0x00000001
#define SENS_SAR2_STOP_S  22

/* SENS_PC_INIT : RW; bitpos: [21:11]; default: 0;
 * initialized PC for ULP-coprocessor
 */

#define SENS_PC_INIT    0x000007ff
#define SENS_PC_INIT_M  (SENS_PC_INIT_V << SENS_PC_INIT_S)
#define SENS_PC_INIT_V  0x000007ff
#define SENS_PC_INIT_S  11

/* SENS_SARCLK_EN : RW; bitpos: [10]; default: 0; */

#define SENS_SARCLK_EN    (BIT(10))
#define SENS_SARCLK_EN_M  (SENS_SARCLK_EN_V << SENS_SARCLK_EN_S)
#define SENS_SARCLK_EN_V  0x00000001
#define SENS_SARCLK_EN_S  10

/* SENS_ULP_CP_START_TOP : RW; bitpos: [9]; default: 0;
 * Write 1 to start ULP-coprocessor  only active when
 * reg_ulp_cp_force_start_top = 1
 */

#define SENS_ULP_CP_START_TOP    (BIT(9))
#define SENS_ULP_CP_START_TOP_M  (SENS_ULP_CP_START_TOP_V << SENS_ULP_CP_START_TOP_S)
#define SENS_ULP_CP_START_TOP_V  0x00000001
#define SENS_ULP_CP_START_TOP_S  9

/* SENS_ULP_CP_FORCE_START_TOP : RW; bitpos: [8]; default: 0;
 * 1: ULP-coprocessor is started by SW  0: ULP-coprocessor is started by
 * timer
 */

#define SENS_ULP_CP_FORCE_START_TOP    (BIT(8))
#define SENS_ULP_CP_FORCE_START_TOP_M  (SENS_ULP_CP_FORCE_START_TOP_V << SENS_ULP_CP_FORCE_START_TOP_S)
#define SENS_ULP_CP_FORCE_START_TOP_V  0x00000001
#define SENS_ULP_CP_FORCE_START_TOP_S  8

/* SENS_SAR2_PWDET_CCT : RW; bitpos: [7:5]; default: 0;
 * SAR2_PWDET_CCT  PA power detector capacitance tuning.
 */

#define SENS_SAR2_PWDET_CCT    0x00000007
#define SENS_SAR2_PWDET_CCT_M  (SENS_SAR2_PWDET_CCT_V << SENS_SAR2_PWDET_CCT_S)
#define SENS_SAR2_PWDET_CCT_V  0x00000007
#define SENS_SAR2_PWDET_CCT_S  5

