apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_sens.h
/* SENS_SAR2_EN_TEST : RW; bitpos: [4]; default: 0;
 * SAR2_EN_TEST  only active when reg_sar2_dig_force = 0
 */

#define SENS_SAR2_EN_TEST    (BIT(4))
#define SENS_SAR2_EN_TEST_M  (SENS_SAR2_EN_TEST_V << SENS_SAR2_EN_TEST_S)
#define SENS_SAR2_EN_TEST_V  0x00000001
#define SENS_SAR2_EN_TEST_S  4

/* SENS_SAR2_BIT_WIDTH : RW; bitpos: [3:2]; default: 3;
 * 00: 9 bit  01: 10 bits  10: 11bits  11: 12bits
 */

#define SENS_SAR2_BIT_WIDTH    0x00000003
#define SENS_SAR2_BIT_WIDTH_M  (SENS_SAR2_BIT_WIDTH_V << SENS_SAR2_BIT_WIDTH_S)
#define SENS_SAR2_BIT_WIDTH_V  0x00000003
#define SENS_SAR2_BIT_WIDTH_S  2

/* SENS_SAR1_BIT_WIDTH : RW; bitpos: [1:0]; default: 3;
 * 00: 9 bit  01: 10 bits  10: 11bits  11: 12bits
 */

#define SENS_SAR1_BIT_WIDTH    0x00000003
#define SENS_SAR1_BIT_WIDTH_M  (SENS_SAR1_BIT_WIDTH_V << SENS_SAR1_BIT_WIDTH_S)
#define SENS_SAR1_BIT_WIDTH_V  0x00000003
#define SENS_SAR1_BIT_WIDTH_S  0

/* SENS_SAR_MEM_WR_CTRL_REG register */

#define SENS_SAR_MEM_WR_CTRL_REG (DR_REG_SENS_BASE + 0x30)

/* SENS_RTC_MEM_WR_OFFST_CLR : W; bitpos: [22]; default: 0; */

#define SENS_RTC_MEM_WR_OFFST_CLR    (BIT(22))
#define SENS_RTC_MEM_WR_OFFST_CLR_M  (SENS_RTC_MEM_WR_OFFST_CLR_V << SENS_RTC_MEM_WR_OFFST_CLR_S)
#define SENS_RTC_MEM_WR_OFFST_CLR_V  0x00000001
#define SENS_RTC_MEM_WR_OFFST_CLR_S  22

/* SENS_MEM_WR_ADDR_SIZE : RW; bitpos: [21:11]; default: 512; */

#define SENS_MEM_WR_ADDR_SIZE    0x000007ff
#define SENS_MEM_WR_ADDR_SIZE_M  (SENS_MEM_WR_ADDR_SIZE_V << SENS_MEM_WR_ADDR_SIZE_S)
#define SENS_MEM_WR_ADDR_SIZE_V  0x000007ff
#define SENS_MEM_WR_ADDR_SIZE_S  11

/* SENS_MEM_WR_ADDR_INIT : RW; bitpos: [10:0]; default: 512; */

#define SENS_MEM_WR_ADDR_INIT    0x000007ff
#define SENS_MEM_WR_ADDR_INIT_M  (SENS_MEM_WR_ADDR_INIT_V << SENS_MEM_WR_ADDR_INIT_S)
#define SENS_MEM_WR_ADDR_INIT_V  0x000007ff
#define SENS_MEM_WR_ADDR_INIT_S  0

/* SENS_SAR_ATTEN1_REG register */

#define SENS_SAR_ATTEN1_REG (DR_REG_SENS_BASE + 0x34)

/* SENS_SAR1_ATTEN : RW; bitpos: [31:0]; default: 4294967295;
 * 2-bit attenuation for each pad  11:1dB  10:6dB  01:3dB  00:0dB
 */

#define SENS_SAR1_ATTEN    0xffffffff
#define SENS_SAR1_ATTEN_M  (SENS_SAR1_ATTEN_V << SENS_SAR1_ATTEN_S)
#define SENS_SAR1_ATTEN_V  0xffffffff
#define SENS_SAR1_ATTEN_S  0

/* SENS_SAR_ATTEN2_REG register */

#define SENS_SAR_ATTEN2_REG (DR_REG_SENS_BASE + 0x38)

/* SENS_SAR2_ATTEN : RW; bitpos: [31:0]; default: 4294967295;
 * 2-bit attenuation for each pad  11:1dB  10:6dB  01:3dB  00:0dB
 */

#define SENS_SAR2_ATTEN    0xffffffff
#define SENS_SAR2_ATTEN_M  (SENS_SAR2_ATTEN_V << SENS_SAR2_ATTEN_S)
#define SENS_SAR2_ATTEN_V  0xffffffff
#define SENS_SAR2_ATTEN_S  0

/* SENS_SAR_SLAVE_ADDR1_REG register */

#define SENS_SAR_SLAVE_ADDR1_REG (DR_REG_SENS_BASE + 0x3c)

/* SENS_MEAS_STATUS : R; bitpos: [29:22]; default: 0; */

#define SENS_MEAS_STATUS    0x000000ff
#define SENS_MEAS_STATUS_M  (SENS_MEAS_STATUS_V << SENS_MEAS_STATUS_S)
#define SENS_MEAS_STATUS_V  0x000000ff
#define SENS_MEAS_STATUS_S  22

/* SENS_I2C_SLAVE_ADDR0 : RW; bitpos: [21:11]; default: 0; */

#define SENS_I2C_SLAVE_ADDR0    0x000007ff
#define SENS_I2C_SLAVE_ADDR0_M  (SENS_I2C_SLAVE_ADDR0_V << SENS_I2C_SLAVE_ADDR0_S)
#define SENS_I2C_SLAVE_ADDR0_V  0x000007ff
#define SENS_I2C_SLAVE_ADDR0_S  11

/* SENS_I2C_SLAVE_ADDR1 : RW; bitpos: [10:0]; default: 0; */

#define SENS_I2C_SLAVE_ADDR1    0x000007ff
#define SENS_I2C_SLAVE_ADDR1_M  (SENS_I2C_SLAVE_ADDR1_V << SENS_I2C_SLAVE_ADDR1_S)
#define SENS_I2C_SLAVE_ADDR1_V  0x000007ff
#define SENS_I2C_SLAVE_ADDR1_S  0

/* SENS_SAR_SLAVE_ADDR2_REG register */

#define SENS_SAR_SLAVE_ADDR2_REG (DR_REG_SENS_BASE + 0x40)

/* SENS_I2C_SLAVE_ADDR2 : RW; bitpos: [21:11]; default: 0; */

#define SENS_I2C_SLAVE_ADDR2    0x000007ff
#define SENS_I2C_SLAVE_ADDR2_M  (SENS_I2C_SLAVE_ADDR2_V << SENS_I2C_SLAVE_ADDR2_S)
#define SENS_I2C_SLAVE_ADDR2_V  0x000007ff
#define SENS_I2C_SLAVE_ADDR2_S  11

/* SENS_I2C_SLAVE_ADDR3 : RW; bitpos: [10:0]; default: 0; */

#define SENS_I2C_SLAVE_ADDR3    0x000007ff
#define SENS_I2C_SLAVE_ADDR3_M  (SENS_I2C_SLAVE_ADDR3_V << SENS_I2C_SLAVE_ADDR3_S)
#define SENS_I2C_SLAVE_ADDR3_V  0x000007ff
#define SENS_I2C_SLAVE_ADDR3_S  0

/* SENS_SAR_SLAVE_ADDR3_REG register */

#define SENS_SAR_SLAVE_ADDR3_REG (DR_REG_SENS_BASE + 0x44)

/* SENS_TSENS_RDY_OUT : R; bitpos: [30]; default: 0;
 * indicate temperature sensor out ready
 */

#define SENS_TSENS_RDY_OUT    (BIT(30))
#define SENS_TSENS_RDY_OUT_M  (SENS_TSENS_RDY_OUT_V << SENS_TSENS_RDY_OUT_S)
#define SENS_TSENS_RDY_OUT_V  0x00000001
#define SENS_TSENS_RDY_OUT_S  30

/* SENS_TSENS_OUT : R; bitpos: [29:22]; default: 0;
 * temperature sensor data out
 */

#define SENS_TSENS_OUT    0x000000ff
#define SENS_TSENS_OUT_M  (SENS_TSENS_OUT_V << SENS_TSENS_OUT_S)
#define SENS_TSENS_OUT_V  0x000000ff
#define SENS_TSENS_OUT_S  22

/* SENS_I2C_SLAVE_ADDR4 : RW; bitpos: [21:11]; default: 0; */

#define SENS_I2C_SLAVE_ADDR4    0x000007ff
#define SENS_I2C_SLAVE_ADDR4_M  (SENS_I2C_SLAVE_ADDR4_V << SENS_I2C_SLAVE_ADDR4_S)
#define SENS_I2C_SLAVE_ADDR4_V  0x000007ff
#define SENS_I2C_SLAVE_ADDR4_S  11

/* SENS_I2C_SLAVE_ADDR5 : RW; bitpos: [10:0]; default: 0; */

#define SENS_I2C_SLAVE_ADDR5    0x000007ff
#define SENS_I2C_SLAVE_ADDR5_M  (SENS_I2C_SLAVE_ADDR5_V << SENS_I2C_SLAVE_ADDR5_S)
#define SENS_I2C_SLAVE_ADDR5_V  0x000007ff
#define SENS_I2C_SLAVE_ADDR5_S  0

/* SENS_SAR_SLAVE_ADDR4_REG register */

#define SENS_SAR_SLAVE_ADDR4_REG (DR_REG_SENS_BASE + 0x48)

/* SENS_I2C_DONE : R; bitpos: [30]; default: 0;
 * indicate I2C done
 */

#define SENS_I2C_DONE    (BIT(30))
#define SENS_I2C_DONE_M  (SENS_I2C_DONE_V << SENS_I2C_DONE_S)
#define SENS_I2C_DONE_V  0x00000001
#define SENS_I2C_DONE_S  30

/* SENS_I2C_RDATA : R; bitpos: [29:22]; default: 0;
 * I2C read data
 */

#define SENS_I2C_RDATA    0x000000ff
#define SENS_I2C_RDATA_M  (SENS_I2C_RDATA_V << SENS_I2C_RDATA_S)
#define SENS_I2C_RDATA_V  0x000000ff
#define SENS_I2C_RDATA_S  22

/* SENS_I2C_SLAVE_ADDR6 : RW; bitpos: [21:11]; default: 0; */

#define SENS_I2C_SLAVE_ADDR6    0x000007ff
#define SENS_I2C_SLAVE_ADDR6_M  (SENS_I2C_SLAVE_ADDR6_V << SENS_I2C_SLAVE_ADDR6_S)
#define SENS_I2C_SLAVE_ADDR6_V  0x000007ff
#define SENS_I2C_SLAVE_ADDR6_S  11

/* SENS_I2C_SLAVE_ADDR7 : RW; bitpos: [10:0]; default: 0; */

#define SENS_I2C_SLAVE_ADDR7    0x000007ff
#define SENS_I2C_SLAVE_ADDR7_M  (SENS_I2C_SLAVE_ADDR7_V << SENS_I2C_SLAVE_ADDR7_S)
#define SENS_I2C_SLAVE_ADDR7_V  0x000007ff
#define SENS_I2C_SLAVE_ADDR7_S  0

/* SENS_SAR_TSENS_CTRL_REG register */

#define SENS_SAR_TSENS_CTRL_REG (DR_REG_SENS_BASE + 0x4c)

/* SENS_TSENS_DUMP_OUT : RW; bitpos: [26]; default: 0;
 * temperature sensor dump out  only active when reg_tsens_power_up_force = 1
 */

#define SENS_TSENS_DUMP_OUT    (BIT(26))
#define SENS_TSENS_DUMP_OUT_M  (SENS_TSENS_DUMP_OUT_V << SENS_TSENS_DUMP_OUT_S)
#define SENS_TSENS_DUMP_OUT_V  0x00000001
#define SENS_TSENS_DUMP_OUT_S  26

/* SENS_TSENS_POWER_UP_FORCE : RW; bitpos: [25]; default: 0;
 * 1: dump out & power up controlled by SW  0: by FSM
 */

#define SENS_TSENS_POWER_UP_FORCE    (BIT(25))
#define SENS_TSENS_POWER_UP_FORCE_M  (SENS_TSENS_POWER_UP_FORCE_V << SENS_TSENS_POWER_UP_FORCE_S)
#define SENS_TSENS_POWER_UP_FORCE_V  0x00000001
#define SENS_TSENS_POWER_UP_FORCE_S  25

