apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_sens.h
/* SENS_TSENS_POWER_UP : RW; bitpos: [24]; default: 0;
 * temperature sensor power up
 */

#define SENS_TSENS_POWER_UP    (BIT(24))
#define SENS_TSENS_POWER_UP_M  (SENS_TSENS_POWER_UP_V << SENS_TSENS_POWER_UP_S)
#define SENS_TSENS_POWER_UP_V  0x00000001
#define SENS_TSENS_POWER_UP_S  24

/* SENS_TSENS_CLK_DIV : RW; bitpos: [23:16]; default: 6;
 * temperature sensor clock divider
 */

#define SENS_TSENS_CLK_DIV    0x000000ff
#define SENS_TSENS_CLK_DIV_M  (SENS_TSENS_CLK_DIV_V << SENS_TSENS_CLK_DIV_S)
#define SENS_TSENS_CLK_DIV_V  0x000000ff
#define SENS_TSENS_CLK_DIV_S  16

/* SENS_TSENS_IN_INV : RW; bitpos: [15]; default: 0;
 * invert temperature sensor data
 */

#define SENS_TSENS_IN_INV    (BIT(15))
#define SENS_TSENS_IN_INV_M  (SENS_TSENS_IN_INV_V << SENS_TSENS_IN_INV_S)
#define SENS_TSENS_IN_INV_V  0x00000001
#define SENS_TSENS_IN_INV_S  15

/* SENS_TSENS_CLK_GATED : RW; bitpos: [14]; default: 1; */

#define SENS_TSENS_CLK_GATED    (BIT(14))
#define SENS_TSENS_CLK_GATED_M  (SENS_TSENS_CLK_GATED_V << SENS_TSENS_CLK_GATED_S)
#define SENS_TSENS_CLK_GATED_V  0x00000001
#define SENS_TSENS_CLK_GATED_S  14

/* SENS_TSENS_CLK_INV : RW; bitpos: [13]; default: 1; */

#define SENS_TSENS_CLK_INV    (BIT(13))
#define SENS_TSENS_CLK_INV_M  (SENS_TSENS_CLK_INV_V << SENS_TSENS_CLK_INV_S)
#define SENS_TSENS_CLK_INV_V  0x00000001
#define SENS_TSENS_CLK_INV_S  13

/* SENS_TSENS_XPD_FORCE : RW; bitpos: [12]; default: 0; */

#define SENS_TSENS_XPD_FORCE    (BIT(12))
#define SENS_TSENS_XPD_FORCE_M  (SENS_TSENS_XPD_FORCE_V << SENS_TSENS_XPD_FORCE_S)
#define SENS_TSENS_XPD_FORCE_V  0x00000001
#define SENS_TSENS_XPD_FORCE_S  12

/* SENS_TSENS_XPD_WAIT : RW; bitpos: [11:0]; default: 2; */

#define SENS_TSENS_XPD_WAIT    0x00000fff
#define SENS_TSENS_XPD_WAIT_M  (SENS_TSENS_XPD_WAIT_V << SENS_TSENS_XPD_WAIT_S)
#define SENS_TSENS_XPD_WAIT_V  0x00000fff
#define SENS_TSENS_XPD_WAIT_S  0

/* SENS_SAR_I2C_CTRL_REG register */

#define SENS_SAR_I2C_CTRL_REG (DR_REG_SENS_BASE + 0x50)

/* SENS_SAR_I2C_START_FORCE : RW; bitpos: [29]; default: 0;
 * 1: I2C started by SW  0: I2C started by FSM
 */

#define SENS_SAR_I2C_START_FORCE    (BIT(29))
#define SENS_SAR_I2C_START_FORCE_M  (SENS_SAR_I2C_START_FORCE_V << SENS_SAR_I2C_START_FORCE_S)
#define SENS_SAR_I2C_START_FORCE_V  0x00000001
#define SENS_SAR_I2C_START_FORCE_S  29

/* SENS_SAR_I2C_START : RW; bitpos: [28]; default: 0;
 * start I2C  only active when reg_sar_i2c_start_force = 1
 */

#define SENS_SAR_I2C_START    (BIT(28))
#define SENS_SAR_I2C_START_M  (SENS_SAR_I2C_START_V << SENS_SAR_I2C_START_S)
#define SENS_SAR_I2C_START_V  0x00000001
#define SENS_SAR_I2C_START_S  28

/* SENS_SAR_I2C_CTRL : RW; bitpos: [27:0]; default: 0;
 * I2C control data  only active when reg_sar_i2c_start_force = 1
 */

#define SENS_SAR_I2C_CTRL    0x0fffffff
#define SENS_SAR_I2C_CTRL_M  (SENS_SAR_I2C_CTRL_V << SENS_SAR_I2C_CTRL_S)
#define SENS_SAR_I2C_CTRL_V  0x0fffffff
#define SENS_SAR_I2C_CTRL_S  0

/* SENS_SAR_MEAS_START1_REG register */

#define SENS_SAR_MEAS_START1_REG (DR_REG_SENS_BASE + 0x54)

/* SENS_SAR1_EN_PAD_FORCE : RW; bitpos: [31]; default: 0;
 * 1: SAR ADC1 pad enable bitmap is controlled by SW  0: SAR ADC1 pad enable
 * bitmap is controlled by ULP-coprocessor
 */

#define SENS_SAR1_EN_PAD_FORCE    (BIT(31))
#define SENS_SAR1_EN_PAD_FORCE_M  (SENS_SAR1_EN_PAD_FORCE_V << SENS_SAR1_EN_PAD_FORCE_S)
#define SENS_SAR1_EN_PAD_FORCE_V  0x00000001
#define SENS_SAR1_EN_PAD_FORCE_S  31

/* SENS_SAR1_EN_PAD : RW; bitpos: [30:19]; default: 0;
 * SAR ADC1 pad enable bitmap  only active when reg_sar1_en_pad_force = 1
 */

#define SENS_SAR1_EN_PAD    0x00000fff
#define SENS_SAR1_EN_PAD_M  (SENS_SAR1_EN_PAD_V << SENS_SAR1_EN_PAD_S)
#define SENS_SAR1_EN_PAD_V  0x00000fff
#define SENS_SAR1_EN_PAD_S  19

/* SENS_MEAS1_START_FORCE : RW; bitpos: [18]; default: 0;
 * 1: SAR ADC1 controller (in RTC) is started by SW  0: SAR ADC1 controller
 * is started by ULP-coprocessor
 */

#define SENS_MEAS1_START_FORCE    (BIT(18))
#define SENS_MEAS1_START_FORCE_M  (SENS_MEAS1_START_FORCE_V << SENS_MEAS1_START_FORCE_S)
#define SENS_MEAS1_START_FORCE_V  0x00000001
#define SENS_MEAS1_START_FORCE_S  18

/* SENS_MEAS1_START_SAR : RW; bitpos: [17]; default: 0;
 * SAR ADC1 controller (in RTC) starts conversion  only active when
 * reg_meas1_start_force = 1
 */

#define SENS_MEAS1_START_SAR    (BIT(17))
#define SENS_MEAS1_START_SAR_M  (SENS_MEAS1_START_SAR_V << SENS_MEAS1_START_SAR_S)
#define SENS_MEAS1_START_SAR_V  0x00000001
#define SENS_MEAS1_START_SAR_S  17

/* SENS_MEAS1_DONE_SAR : R; bitpos: [16]; default: 0;
 * SAR ADC1 conversion done indication
 */

#define SENS_MEAS1_DONE_SAR    (BIT(16))
#define SENS_MEAS1_DONE_SAR_M  (SENS_MEAS1_DONE_SAR_V << SENS_MEAS1_DONE_SAR_S)
#define SENS_MEAS1_DONE_SAR_V  0x00000001
#define SENS_MEAS1_DONE_SAR_S  16

/* SENS_MEAS1_DATA_SAR : R; bitpos: [15:0]; default: 0;
 * SAR ADC1 data
 */

#define SENS_MEAS1_DATA_SAR    0x0000ffff
#define SENS_MEAS1_DATA_SAR_M  (SENS_MEAS1_DATA_SAR_V << SENS_MEAS1_DATA_SAR_S)
#define SENS_MEAS1_DATA_SAR_V  0x0000ffff
#define SENS_MEAS1_DATA_SAR_S  0

/* SENS_SAR_TOUCH_CTRL1_REG register */

#define SENS_SAR_TOUCH_CTRL1_REG (DR_REG_SENS_BASE + 0x58)

/* SENS_HALL_PHASE_FORCE : RW; bitpos: [27]; default: 0;
 * 1: HALL PHASE is controlled by SW  0: HALL PHASE is controlled by FSM in
 * ULP-coprocessor
 */

#define SENS_HALL_PHASE_FORCE    (BIT(27))
#define SENS_HALL_PHASE_FORCE_M  (SENS_HALL_PHASE_FORCE_V << SENS_HALL_PHASE_FORCE_S)
#define SENS_HALL_PHASE_FORCE_V  0x00000001
#define SENS_HALL_PHASE_FORCE_S  27

/* SENS_XPD_HALL_FORCE : RW; bitpos: [26]; default: 0;
 * 1: XPD HALL is controlled by SW. 0: XPD HALL is controlled by FSM in
 * ULP-coprocessor
 */

#define SENS_XPD_HALL_FORCE    (BIT(26))
#define SENS_XPD_HALL_FORCE_M  (SENS_XPD_HALL_FORCE_V << SENS_XPD_HALL_FORCE_S)
#define SENS_XPD_HALL_FORCE_V  0x00000001
#define SENS_XPD_HALL_FORCE_S  26

/* SENS_TOUCH_OUT_1EN : RW; bitpos: [25]; default: 1;
 * 1: wakeup interrupt is generated if SET1 is "touched"  0: wakeup
 * interrupt is generated only if SET1 & SET2 is both "touched"
 */

#define SENS_TOUCH_OUT_1EN    (BIT(25))
#define SENS_TOUCH_OUT_1EN_M  (SENS_TOUCH_OUT_1EN_V << SENS_TOUCH_OUT_1EN_S)
#define SENS_TOUCH_OUT_1EN_V  0x00000001
#define SENS_TOUCH_OUT_1EN_S  25

/* SENS_TOUCH_OUT_SEL : RW; bitpos: [24]; default: 0;
 * 1: when the counter is greater then the threshold  the touch pad is
 * considered as "touched"  0: when the counter is less than the threshold
 * the touch pad is considered as "touched"
 */

#define SENS_TOUCH_OUT_SEL    (BIT(24))
#define SENS_TOUCH_OUT_SEL_M  (SENS_TOUCH_OUT_SEL_V << SENS_TOUCH_OUT_SEL_S)
#define SENS_TOUCH_OUT_SEL_V  0x00000001
#define SENS_TOUCH_OUT_SEL_S  24

/* SENS_TOUCH_XPD_WAIT : RW; bitpos: [23:16]; default: 4;
 * the waiting cycles (in 8MHz) between TOUCH_START and TOUCH_XPD
 */

#define SENS_TOUCH_XPD_WAIT    0x000000ff
#define SENS_TOUCH_XPD_WAIT_M  (SENS_TOUCH_XPD_WAIT_V << SENS_TOUCH_XPD_WAIT_S)
#define SENS_TOUCH_XPD_WAIT_V  0x000000ff
#define SENS_TOUCH_XPD_WAIT_S  16

/* SENS_TOUCH_MEAS_DELAY : RW; bitpos: [15:0]; default: 4096;
 * the meas length (in 8MHz)
 */

