apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_sens.h
#define SENS_TOUCH_MEAS_DELAY    0x0000ffff
#define SENS_TOUCH_MEAS_DELAY_M  (SENS_TOUCH_MEAS_DELAY_V << SENS_TOUCH_MEAS_DELAY_S)
#define SENS_TOUCH_MEAS_DELAY_V  0x0000ffff
#define SENS_TOUCH_MEAS_DELAY_S  0

/* SENS_SAR_TOUCH_THRES1_REG register */

#define SENS_SAR_TOUCH_THRES1_REG (DR_REG_SENS_BASE + 0x5c)

/* SENS_TOUCH_OUT_TH0 : RW; bitpos: [31:16]; default: 0;
 * the threshold for touch pad 0
 */

#define SENS_TOUCH_OUT_TH0    0x0000ffff
#define SENS_TOUCH_OUT_TH0_M  (SENS_TOUCH_OUT_TH0_V << SENS_TOUCH_OUT_TH0_S)
#define SENS_TOUCH_OUT_TH0_V  0x0000ffff
#define SENS_TOUCH_OUT_TH0_S  16

/* SENS_TOUCH_OUT_TH1 : RW; bitpos: [15:0]; default: 0;
 * the threshold for touch pad 1
 */

#define SENS_TOUCH_OUT_TH1    0x0000ffff
#define SENS_TOUCH_OUT_TH1_M  (SENS_TOUCH_OUT_TH1_V << SENS_TOUCH_OUT_TH1_S)
#define SENS_TOUCH_OUT_TH1_V  0x0000ffff
#define SENS_TOUCH_OUT_TH1_S  0

/* SENS_SAR_TOUCH_THRES2_REG register */

#define SENS_SAR_TOUCH_THRES2_REG (DR_REG_SENS_BASE + 0x60)

/* SENS_TOUCH_OUT_TH2 : RW; bitpos: [31:16]; default: 0;
 * the threshold for touch pad 2
 */

#define SENS_TOUCH_OUT_TH2    0x0000ffff
#define SENS_TOUCH_OUT_TH2_M  (SENS_TOUCH_OUT_TH2_V << SENS_TOUCH_OUT_TH2_S)
#define SENS_TOUCH_OUT_TH2_V  0x0000ffff
#define SENS_TOUCH_OUT_TH2_S  16

/* SENS_TOUCH_OUT_TH3 : RW; bitpos: [15:0]; default: 0;
 * the threshold for touch pad 3
 */

#define SENS_TOUCH_OUT_TH3    0x0000ffff
#define SENS_TOUCH_OUT_TH3_M  (SENS_TOUCH_OUT_TH3_V << SENS_TOUCH_OUT_TH3_S)
#define SENS_TOUCH_OUT_TH3_V  0x0000ffff
#define SENS_TOUCH_OUT_TH3_S  0

/* SENS_SAR_TOUCH_THRES3_REG register */

#define SENS_SAR_TOUCH_THRES3_REG (DR_REG_SENS_BASE + 0x64)

/* SENS_TOUCH_OUT_TH4 : RW; bitpos: [31:16]; default: 0;
 * the threshold for touch pad 4
 */

#define SENS_TOUCH_OUT_TH4    0x0000ffff
#define SENS_TOUCH_OUT_TH4_M  (SENS_TOUCH_OUT_TH4_V << SENS_TOUCH_OUT_TH4_S)
#define SENS_TOUCH_OUT_TH4_V  0x0000ffff
#define SENS_TOUCH_OUT_TH4_S  16

/* SENS_TOUCH_OUT_TH5 : RW; bitpos: [15:0]; default: 0;
 * the threshold for touch pad 5
 */

#define SENS_TOUCH_OUT_TH5    0x0000ffff
#define SENS_TOUCH_OUT_TH5_M  (SENS_TOUCH_OUT_TH5_V << SENS_TOUCH_OUT_TH5_S)
#define SENS_TOUCH_OUT_TH5_V  0x0000ffff
#define SENS_TOUCH_OUT_TH5_S  0

/* SENS_SAR_TOUCH_THRES4_REG register */

#define SENS_SAR_TOUCH_THRES4_REG (DR_REG_SENS_BASE + 0x68)

/* SENS_TOUCH_OUT_TH6 : RW; bitpos: [31:16]; default: 0;
 * the threshold for touch pad 6
 */

#define SENS_TOUCH_OUT_TH6    0x0000ffff
#define SENS_TOUCH_OUT_TH6_M  (SENS_TOUCH_OUT_TH6_V << SENS_TOUCH_OUT_TH6_S)
#define SENS_TOUCH_OUT_TH6_V  0x0000ffff
#define SENS_TOUCH_OUT_TH6_S  16

/* SENS_TOUCH_OUT_TH7 : RW; bitpos: [15:0]; default: 0;
 * the threshold for touch pad 7
 */

#define SENS_TOUCH_OUT_TH7    0x0000ffff
#define SENS_TOUCH_OUT_TH7_M  (SENS_TOUCH_OUT_TH7_V << SENS_TOUCH_OUT_TH7_S)
#define SENS_TOUCH_OUT_TH7_V  0x0000ffff
#define SENS_TOUCH_OUT_TH7_S  0

/* SENS_SAR_TOUCH_THRES5_REG register */

#define SENS_SAR_TOUCH_THRES5_REG (DR_REG_SENS_BASE + 0x6c)

/* SENS_TOUCH_OUT_TH8 : RW; bitpos: [31:16]; default: 0;
 * the threshold for touch pad 8
 */

#define SENS_TOUCH_OUT_TH8    0x0000ffff
#define SENS_TOUCH_OUT_TH8_M  (SENS_TOUCH_OUT_TH8_V << SENS_TOUCH_OUT_TH8_S)
#define SENS_TOUCH_OUT_TH8_V  0x0000ffff
#define SENS_TOUCH_OUT_TH8_S  16

/* SENS_TOUCH_OUT_TH9 : RW; bitpos: [15:0]; default: 0;
 * the threshold for touch pad 9
 */

#define SENS_TOUCH_OUT_TH9    0x0000ffff
#define SENS_TOUCH_OUT_TH9_M  (SENS_TOUCH_OUT_TH9_V << SENS_TOUCH_OUT_TH9_S)
#define SENS_TOUCH_OUT_TH9_V  0x0000ffff
#define SENS_TOUCH_OUT_TH9_S  0

/* SENS_SAR_TOUCH_OUT1_REG register */

#define SENS_SAR_TOUCH_OUT1_REG (DR_REG_SENS_BASE + 0x70)

/* SENS_TOUCH_MEAS_OUT0 : R; bitpos: [31:16]; default: 0;
 * the counter for touch pad 0
 */

#define SENS_TOUCH_MEAS_OUT0    0x0000ffff
#define SENS_TOUCH_MEAS_OUT0_M  (SENS_TOUCH_MEAS_OUT0_V << SENS_TOUCH_MEAS_OUT0_S)
#define SENS_TOUCH_MEAS_OUT0_V  0x0000ffff
#define SENS_TOUCH_MEAS_OUT0_S  16

/* SENS_TOUCH_MEAS_OUT1 : R; bitpos: [15:0]; default: 0;
 * the counter for touch pad 1
 */

#define SENS_TOUCH_MEAS_OUT1    0x0000ffff
#define SENS_TOUCH_MEAS_OUT1_M  (SENS_TOUCH_MEAS_OUT1_V << SENS_TOUCH_MEAS_OUT1_S)
#define SENS_TOUCH_MEAS_OUT1_V  0x0000ffff
#define SENS_TOUCH_MEAS_OUT1_S  0

/* SENS_SAR_TOUCH_OUT2_REG register */

#define SENS_SAR_TOUCH_OUT2_REG (DR_REG_SENS_BASE + 0x74)

/* SENS_TOUCH_MEAS_OUT2 : R; bitpos: [31:16]; default: 0;
 * the counter for touch pad 2
 */

#define SENS_TOUCH_MEAS_OUT2    0x0000ffff
#define SENS_TOUCH_MEAS_OUT2_M  (SENS_TOUCH_MEAS_OUT2_V << SENS_TOUCH_MEAS_OUT2_S)
#define SENS_TOUCH_MEAS_OUT2_V  0x0000ffff
#define SENS_TOUCH_MEAS_OUT2_S  16

/* SENS_TOUCH_MEAS_OUT3 : R; bitpos: [15:0]; default: 0;
 * the counter for touch pad 3
 */

#define SENS_TOUCH_MEAS_OUT3    0x0000ffff
#define SENS_TOUCH_MEAS_OUT3_M  (SENS_TOUCH_MEAS_OUT3_V << SENS_TOUCH_MEAS_OUT3_S)
#define SENS_TOUCH_MEAS_OUT3_V  0x0000ffff
#define SENS_TOUCH_MEAS_OUT3_S  0

/* SENS_SAR_TOUCH_OUT3_REG register */

#define SENS_SAR_TOUCH_OUT3_REG (DR_REG_SENS_BASE + 0x78)

/* SENS_TOUCH_MEAS_OUT4 : R; bitpos: [31:16]; default: 0;
 * the counter for touch pad 4
 */

#define SENS_TOUCH_MEAS_OUT4    0x0000ffff
#define SENS_TOUCH_MEAS_OUT4_M  (SENS_TOUCH_MEAS_OUT4_V << SENS_TOUCH_MEAS_OUT4_S)
#define SENS_TOUCH_MEAS_OUT4_V  0x0000ffff
#define SENS_TOUCH_MEAS_OUT4_S  16

/* SENS_TOUCH_MEAS_OUT5 : R; bitpos: [15:0]; default: 0;
 * the counter for touch pad 5
 */

#define SENS_TOUCH_MEAS_OUT5    0x0000ffff
#define SENS_TOUCH_MEAS_OUT5_M  (SENS_TOUCH_MEAS_OUT5_V << SENS_TOUCH_MEAS_OUT5_S)
#define SENS_TOUCH_MEAS_OUT5_V  0x0000ffff
#define SENS_TOUCH_MEAS_OUT5_S  0

/* SENS_SAR_TOUCH_OUT4_REG register */

#define SENS_SAR_TOUCH_OUT4_REG (DR_REG_SENS_BASE + 0x7c)

/* SENS_TOUCH_MEAS_OUT6 : R; bitpos: [31:16]; default: 0;
 * the counter for touch pad 6
 */

#define SENS_TOUCH_MEAS_OUT6    0x0000ffff
#define SENS_TOUCH_MEAS_OUT6_M  (SENS_TOUCH_MEAS_OUT6_V << SENS_TOUCH_MEAS_OUT6_S)
#define SENS_TOUCH_MEAS_OUT6_V  0x0000ffff
#define SENS_TOUCH_MEAS_OUT6_S  16

/* SENS_TOUCH_MEAS_OUT7 : R; bitpos: [15:0]; default: 0;
 * the counter for touch pad 7
 */

#define SENS_TOUCH_MEAS_OUT7    0x0000ffff
#define SENS_TOUCH_MEAS_OUT7_M  (SENS_TOUCH_MEAS_OUT7_V << SENS_TOUCH_MEAS_OUT7_S)
#define SENS_TOUCH_MEAS_OUT7_V  0x0000ffff
#define SENS_TOUCH_MEAS_OUT7_S  0

/* SENS_SAR_TOUCH_OUT5_REG register */

#define SENS_SAR_TOUCH_OUT5_REG (DR_REG_SENS_BASE + 0x80)

/* SENS_TOUCH_MEAS_OUT8 : R; bitpos: [31:16]; default: 0;
 * the counter for touch pad 8
 */

#define SENS_TOUCH_MEAS_OUT8    0x0000ffff
#define SENS_TOUCH_MEAS_OUT8_M  (SENS_TOUCH_MEAS_OUT8_V << SENS_TOUCH_MEAS_OUT8_S)
#define SENS_TOUCH_MEAS_OUT8_V  0x0000ffff
#define SENS_TOUCH_MEAS_OUT8_S  16

/* SENS_TOUCH_MEAS_OUT9 : R; bitpos: [15:0]; default: 0;
 * the counter for touch pad 9
 */

#define SENS_TOUCH_MEAS_OUT9    0x0000ffff
#define SENS_TOUCH_MEAS_OUT9_M  (SENS_TOUCH_MEAS_OUT9_V << SENS_TOUCH_MEAS_OUT9_S)
#define SENS_TOUCH_MEAS_OUT9_V  0x0000ffff
#define SENS_TOUCH_MEAS_OUT9_S  0

