apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_sens.h
/* SENS_SAR_TOUCH_CTRL2_REG register */

#define SENS_SAR_TOUCH_CTRL2_REG (DR_REG_SENS_BASE + 0x84)

/* SENS_TOUCH_MEAS_EN_CLR : W; bitpos: [30]; default: 0;
 * to clear reg_touch_meas_en
 */

#define SENS_TOUCH_MEAS_EN_CLR    (BIT(30))
#define SENS_TOUCH_MEAS_EN_CLR_M  (SENS_TOUCH_MEAS_EN_CLR_V << SENS_TOUCH_MEAS_EN_CLR_S)
#define SENS_TOUCH_MEAS_EN_CLR_V  0x00000001
#define SENS_TOUCH_MEAS_EN_CLR_S  30

/* SENS_TOUCH_SLEEP_CYCLES : RW; bitpos: [29:14]; default: 256;
 * sleep cycles for timer
 */

#define SENS_TOUCH_SLEEP_CYCLES    0x0000ffff
#define SENS_TOUCH_SLEEP_CYCLES_M  (SENS_TOUCH_SLEEP_CYCLES_V << SENS_TOUCH_SLEEP_CYCLES_S)
#define SENS_TOUCH_SLEEP_CYCLES_V  0x0000ffff
#define SENS_TOUCH_SLEEP_CYCLES_S  14

/* SENS_TOUCH_START_FORCE : RW; bitpos: [13]; default: 0;
 * 1: to start touch fsm by SW  0: to start touch fsm by timer
 */

#define SENS_TOUCH_START_FORCE    (BIT(13))
#define SENS_TOUCH_START_FORCE_M  (SENS_TOUCH_START_FORCE_V << SENS_TOUCH_START_FORCE_S)
#define SENS_TOUCH_START_FORCE_V  0x00000001
#define SENS_TOUCH_START_FORCE_S  13

/* SENS_TOUCH_START_EN : RW; bitpos: [12]; default: 0;
 * 1: start touch fsm  valid when reg_touch_start_force is set
 */

#define SENS_TOUCH_START_EN    (BIT(12))
#define SENS_TOUCH_START_EN_M  (SENS_TOUCH_START_EN_V << SENS_TOUCH_START_EN_S)
#define SENS_TOUCH_START_EN_V  0x00000001
#define SENS_TOUCH_START_EN_S  12

/* SENS_TOUCH_START_FSM_EN : RW; bitpos: [11]; default: 1;
 * 1: TOUCH_START & TOUCH_XPD is controlled by touch fsm  0: TOUCH_START &
 * TOUCH_XPD is controlled by registers
 */

#define SENS_TOUCH_START_FSM_EN    (BIT(11))
#define SENS_TOUCH_START_FSM_EN_M  (SENS_TOUCH_START_FSM_EN_V << SENS_TOUCH_START_FSM_EN_S)
#define SENS_TOUCH_START_FSM_EN_V  0x00000001
#define SENS_TOUCH_START_FSM_EN_S  11

/* SENS_TOUCH_MEAS_DONE : R; bitpos: [10]; default: 0;
 * fsm set 1 to indicate touch touch meas is done
 */

#define SENS_TOUCH_MEAS_DONE    (BIT(10))
#define SENS_TOUCH_MEAS_DONE_M  (SENS_TOUCH_MEAS_DONE_V << SENS_TOUCH_MEAS_DONE_S)
#define SENS_TOUCH_MEAS_DONE_V  0x00000001
#define SENS_TOUCH_MEAS_DONE_S  10

/* SENS_TOUCH_MEAS_EN : R; bitpos: [9:0]; default: 0;
 * 10-bit register to indicate which pads are "touched"
 */

#define SENS_TOUCH_MEAS_EN    0x000003ff
#define SENS_TOUCH_MEAS_EN_M  (SENS_TOUCH_MEAS_EN_V << SENS_TOUCH_MEAS_EN_S)
#define SENS_TOUCH_MEAS_EN_V  0x000003ff
#define SENS_TOUCH_MEAS_EN_S  0

/* SENS_SAR_TOUCH_ENABLE_REG register */

#define SENS_SAR_TOUCH_ENABLE_REG (DR_REG_SENS_BASE + 0x8c)

/* SENS_TOUCH_PAD_OUTEN1 : RW; bitpos: [29:20]; default: 1023;
 * Bitmap defining SET1 for generating wakeup interrupt. SET1 is "touched"
 * only if at least one of touch pad in SET1 is "touched".
 */

#define SENS_TOUCH_PAD_OUTEN1    0x000003ff
#define SENS_TOUCH_PAD_OUTEN1_M  (SENS_TOUCH_PAD_OUTEN1_V << SENS_TOUCH_PAD_OUTEN1_S)
#define SENS_TOUCH_PAD_OUTEN1_V  0x000003ff
#define SENS_TOUCH_PAD_OUTEN1_S  20

/* SENS_TOUCH_PAD_OUTEN2 : RW; bitpos: [19:10]; default: 1023;
 * Bitmap defining SET2 for generating wakeup interrupt. SET2 is "touched"
 * only if at least one of touch pad in SET2 is "touched".
 */

#define SENS_TOUCH_PAD_OUTEN2    0x000003ff
#define SENS_TOUCH_PAD_OUTEN2_M  (SENS_TOUCH_PAD_OUTEN2_V << SENS_TOUCH_PAD_OUTEN2_S)
#define SENS_TOUCH_PAD_OUTEN2_V  0x000003ff
#define SENS_TOUCH_PAD_OUTEN2_S  10

/* SENS_TOUCH_PAD_WORKEN : RW; bitpos: [9:0]; default: 1023;
 * Bitmap defining the working set during the measurement.
 */

#define SENS_TOUCH_PAD_WORKEN    0x000003ff
#define SENS_TOUCH_PAD_WORKEN_M  (SENS_TOUCH_PAD_WORKEN_V << SENS_TOUCH_PAD_WORKEN_S)
#define SENS_TOUCH_PAD_WORKEN_V  0x000003ff
#define SENS_TOUCH_PAD_WORKEN_S  0

/* SENS_SAR_READ_CTRL2_REG register */

#define SENS_SAR_READ_CTRL2_REG (DR_REG_SENS_BASE + 0x90)

/* SENS_SAR2_DATA_INV : RW; bitpos: [29]; default: 0;
 * Invert SAR ADC2 data
 */

#define SENS_SAR2_DATA_INV    (BIT(29))
#define SENS_SAR2_DATA_INV_M  (SENS_SAR2_DATA_INV_V << SENS_SAR2_DATA_INV_S)
#define SENS_SAR2_DATA_INV_V  0x00000001
#define SENS_SAR2_DATA_INV_S  29

/* SENS_SAR2_DIG_FORCE : RW; bitpos: [28]; default: 0;
 * 1: SAR ADC2 controlled by DIG ADC2 CTRL or PWDET CTRL  0: SAR ADC2
 * controlled by RTC ADC2 CTRL
 */

#define SENS_SAR2_DIG_FORCE    (BIT(28))
#define SENS_SAR2_DIG_FORCE_M  (SENS_SAR2_DIG_FORCE_V << SENS_SAR2_DIG_FORCE_S)
#define SENS_SAR2_DIG_FORCE_V  0x00000001
#define SENS_SAR2_DIG_FORCE_S  28

/* SENS_SAR2_PWDET_FORCE : RW; bitpos: [27]; default: 0; */

#define SENS_SAR2_PWDET_FORCE    (BIT(27))
#define SENS_SAR2_PWDET_FORCE_M  (SENS_SAR2_PWDET_FORCE_V << SENS_SAR2_PWDET_FORCE_S)
#define SENS_SAR2_PWDET_FORCE_V  0x00000001
#define SENS_SAR2_PWDET_FORCE_S  27

/* SENS_SAR2_SAMPLE_NUM : RW; bitpos: [26:19]; default: 0; */

#define SENS_SAR2_SAMPLE_NUM    0x000000ff
#define SENS_SAR2_SAMPLE_NUM_M  (SENS_SAR2_SAMPLE_NUM_V << SENS_SAR2_SAMPLE_NUM_S)
#define SENS_SAR2_SAMPLE_NUM_V  0x000000ff
#define SENS_SAR2_SAMPLE_NUM_S  19

/* SENS_SAR2_CLK_GATED : RW; bitpos: [18]; default: 1; */

#define SENS_SAR2_CLK_GATED    (BIT(18))
#define SENS_SAR2_CLK_GATED_M  (SENS_SAR2_CLK_GATED_V << SENS_SAR2_CLK_GATED_S)
#define SENS_SAR2_CLK_GATED_V  0x00000001
#define SENS_SAR2_CLK_GATED_S  18

/* SENS_SAR2_SAMPLE_BIT : RW; bitpos: [17:16]; default: 3;
 * 00: for 9-bit width  01: for 10-bit width  10: for 11-bit width  11: for
 * 12-bit width
 */

#define SENS_SAR2_SAMPLE_BIT    0x00000003
#define SENS_SAR2_SAMPLE_BIT_M  (SENS_SAR2_SAMPLE_BIT_V << SENS_SAR2_SAMPLE_BIT_S)
#define SENS_SAR2_SAMPLE_BIT_V  0x00000003
#define SENS_SAR2_SAMPLE_BIT_S  16

/* SENS_SAR2_SAMPLE_CYCLE : RW; bitpos: [15:8]; default: 9;
 * sample cycles for SAR ADC2
 */

#define SENS_SAR2_SAMPLE_CYCLE    0x000000ff
#define SENS_SAR2_SAMPLE_CYCLE_M  (SENS_SAR2_SAMPLE_CYCLE_V << SENS_SAR2_SAMPLE_CYCLE_S)
#define SENS_SAR2_SAMPLE_CYCLE_V  0x000000ff
#define SENS_SAR2_SAMPLE_CYCLE_S  8

/* SENS_SAR2_CLK_DIV : RW; bitpos: [7:0]; default: 2;
 * clock divider
 */

#define SENS_SAR2_CLK_DIV    0x000000ff
#define SENS_SAR2_CLK_DIV_M  (SENS_SAR2_CLK_DIV_V << SENS_SAR2_CLK_DIV_S)
#define SENS_SAR2_CLK_DIV_V  0x000000ff
#define SENS_SAR2_CLK_DIV_S  0

/* SENS_SAR_MEAS_START2_REG register */

#define SENS_SAR_MEAS_START2_REG (DR_REG_SENS_BASE + 0x94)

/* SENS_SAR2_EN_PAD_FORCE : RW; bitpos: [31]; default: 0;
 * 1: SAR ADC2 pad enable bitmap is controlled by SW  0: SAR ADC2 pad enable
 * bitmap is controlled by ULP-coprocessor
 */

