apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_sens.h
#define SENS_SAR2_EN_PAD_FORCE    (BIT(31))
#define SENS_SAR2_EN_PAD_FORCE_M  (SENS_SAR2_EN_PAD_FORCE_V << SENS_SAR2_EN_PAD_FORCE_S)
#define SENS_SAR2_EN_PAD_FORCE_V  0x00000001
#define SENS_SAR2_EN_PAD_FORCE_S  31

/* SENS_SAR2_EN_PAD : RW; bitpos: [30:19]; default: 0;
 * SAR ADC2 pad enable bitmap  only active when reg_sar2_en_pad_force = 1
 */

#define SENS_SAR2_EN_PAD    0x00000fff
#define SENS_SAR2_EN_PAD_M  (SENS_SAR2_EN_PAD_V << SENS_SAR2_EN_PAD_S)
#define SENS_SAR2_EN_PAD_V  0x00000fff
#define SENS_SAR2_EN_PAD_S  19

/* SENS_MEAS2_START_FORCE : RW; bitpos: [18]; default: 0;
 * 1: SAR ADC2 controller (in RTC) is started by SW  0: SAR ADC2 controller
 * is started by ULP-coprocessor
 */

#define SENS_MEAS2_START_FORCE    (BIT(18))
#define SENS_MEAS2_START_FORCE_M  (SENS_MEAS2_START_FORCE_V << SENS_MEAS2_START_FORCE_S)
#define SENS_MEAS2_START_FORCE_V  0x00000001
#define SENS_MEAS2_START_FORCE_S  18

/* SENS_MEAS2_START_SAR : RW; bitpos: [17]; default: 0;
 * SAR ADC2 controller (in RTC) starts conversion  only active when
 * reg_meas2_start_force = 1
 */

#define SENS_MEAS2_START_SAR    (BIT(17))
#define SENS_MEAS2_START_SAR_M  (SENS_MEAS2_START_SAR_V << SENS_MEAS2_START_SAR_S)
#define SENS_MEAS2_START_SAR_V  0x00000001
#define SENS_MEAS2_START_SAR_S  17

/* SENS_MEAS2_DONE_SAR : R; bitpos: [16]; default: 0;
 * SAR ADC2 conversion done indication
 */

#define SENS_MEAS2_DONE_SAR    (BIT(16))
#define SENS_MEAS2_DONE_SAR_M  (SENS_MEAS2_DONE_SAR_V << SENS_MEAS2_DONE_SAR_S)
#define SENS_MEAS2_DONE_SAR_V  0x00000001
#define SENS_MEAS2_DONE_SAR_S  16

/* SENS_MEAS2_DATA_SAR : R; bitpos: [15:0]; default: 0;
 * SAR ADC2 data
 */

#define SENS_MEAS2_DATA_SAR    0x0000ffff
#define SENS_MEAS2_DATA_SAR_M  (SENS_MEAS2_DATA_SAR_V << SENS_MEAS2_DATA_SAR_S)
#define SENS_MEAS2_DATA_SAR_V  0x0000ffff
#define SENS_MEAS2_DATA_SAR_S  0

/* SENS_SAR_DAC_CTRL1_REG register */

#define SENS_SAR_DAC_CTRL1_REG (DR_REG_SENS_BASE + 0x98)

/* SENS_DAC_CLK_INV : RW; bitpos: [25]; default: 0;
 * 1: invert PDAC_CLK
 */

#define SENS_DAC_CLK_INV    (BIT(25))
#define SENS_DAC_CLK_INV_M  (SENS_DAC_CLK_INV_V << SENS_DAC_CLK_INV_S)
#define SENS_DAC_CLK_INV_V  0x00000001
#define SENS_DAC_CLK_INV_S  25

/* SENS_DAC_CLK_FORCE_HIGH : RW; bitpos: [24]; default: 0;
 * 1: force PDAC_CLK to high
 */

#define SENS_DAC_CLK_FORCE_HIGH    (BIT(24))
#define SENS_DAC_CLK_FORCE_HIGH_M  (SENS_DAC_CLK_FORCE_HIGH_V << SENS_DAC_CLK_FORCE_HIGH_S)
#define SENS_DAC_CLK_FORCE_HIGH_V  0x00000001
#define SENS_DAC_CLK_FORCE_HIGH_S  24

/* SENS_DAC_CLK_FORCE_LOW : RW; bitpos: [23]; default: 0;
 * 1: force PDAC_CLK to low
 */

#define SENS_DAC_CLK_FORCE_LOW    (BIT(23))
#define SENS_DAC_CLK_FORCE_LOW_M  (SENS_DAC_CLK_FORCE_LOW_V << SENS_DAC_CLK_FORCE_LOW_S)
#define SENS_DAC_CLK_FORCE_LOW_V  0x00000001
#define SENS_DAC_CLK_FORCE_LOW_S  23

/* SENS_DAC_DIG_FORCE : RW; bitpos: [22]; default: 0;
 * 1: DAC1 & DAC2 use DMA  0: DAC1 & DAC2 do not use DMA
 */

#define SENS_DAC_DIG_FORCE    (BIT(22))
#define SENS_DAC_DIG_FORCE_M  (SENS_DAC_DIG_FORCE_V << SENS_DAC_DIG_FORCE_S)
#define SENS_DAC_DIG_FORCE_V  0x00000001
#define SENS_DAC_DIG_FORCE_S  22

/* SENS_DEBUG_BIT_SEL : RW; bitpos: [21:17]; default: 0; */

#define SENS_DEBUG_BIT_SEL    0x0000001f
#define SENS_DEBUG_BIT_SEL_M  (SENS_DEBUG_BIT_SEL_V << SENS_DEBUG_BIT_SEL_S)
#define SENS_DEBUG_BIT_SEL_V  0x0000001f
#define SENS_DEBUG_BIT_SEL_S  17

/* SENS_SW_TONE_EN : RW; bitpos: [16]; default: 0;
 * 1: enable CW generator  0: disable CW generator
 */

#define SENS_SW_TONE_EN    (BIT(16))
#define SENS_SW_TONE_EN_M  (SENS_SW_TONE_EN_V << SENS_SW_TONE_EN_S)
#define SENS_SW_TONE_EN_V  0x00000001
#define SENS_SW_TONE_EN_S  16

/* SENS_SW_FSTEP : RW; bitpos: [15:0]; default: 0;
 * frequency step for CW generator  can be used to adjust the frequency
 */

#define SENS_SW_FSTEP    0x0000ffff
#define SENS_SW_FSTEP_M  (SENS_SW_FSTEP_V << SENS_SW_FSTEP_S)
#define SENS_SW_FSTEP_V  0x0000ffff
#define SENS_SW_FSTEP_S  0

/* SENS_SAR_DAC_CTRL2_REG register */

#define SENS_SAR_DAC_CTRL2_REG (DR_REG_SENS_BASE + 0x9c)

/* SENS_DAC_CW_EN2 : RW; bitpos: [25]; default: 1;
 * 1: to select CW generator as source to PDAC2_DAC[7:0]  0: to select
 * register reg_pdac2_dac[7:0] as source to PDAC2_DAC[7:0]
 */

#define SENS_DAC_CW_EN2    (BIT(25))
#define SENS_DAC_CW_EN2_M  (SENS_DAC_CW_EN2_V << SENS_DAC_CW_EN2_S)
#define SENS_DAC_CW_EN2_V  0x00000001
#define SENS_DAC_CW_EN2_S  25

/* SENS_DAC_CW_EN1 : RW; bitpos: [24]; default: 1;
 * 1: to select CW generator as source to PDAC1_DAC[7:0]  0: to select
 * register reg_pdac1_dac[7:0] as source to PDAC1_DAC[7:0]
 */

#define SENS_DAC_CW_EN1    (BIT(24))
#define SENS_DAC_CW_EN1_M  (SENS_DAC_CW_EN1_V << SENS_DAC_CW_EN1_S)
#define SENS_DAC_CW_EN1_V  0x00000001
#define SENS_DAC_CW_EN1_S  24

/* SENS_DAC_INV2 : RW; bitpos: [23:22]; default: 0;
 * 00: do not invert any bits  01: invert all bits  10: invert MSB  11:
 * invert all bits except MSB
 */

#define SENS_DAC_INV2    0x00000003
#define SENS_DAC_INV2_M  (SENS_DAC_INV2_V << SENS_DAC_INV2_S)
#define SENS_DAC_INV2_V  0x00000003
#define SENS_DAC_INV2_S  22

/* SENS_DAC_INV1 : RW; bitpos: [21:20]; default: 0;
 * 00: do not invert any bits  01: invert all bits  10: invert MSB  11:
 * invert all bits except MSB
 */

#define SENS_DAC_INV1    0x00000003
#define SENS_DAC_INV1_M  (SENS_DAC_INV1_V << SENS_DAC_INV1_S)
#define SENS_DAC_INV1_V  0x00000003
#define SENS_DAC_INV1_S  20

/* SENS_DAC_SCALE2 : RW; bitpos: [19:18]; default: 0;
 * 00: no scale  01: scale to 1/2  10: scale to 1/4  scale to 1/8
 */

#define SENS_DAC_SCALE2    0x00000003
#define SENS_DAC_SCALE2_M  (SENS_DAC_SCALE2_V << SENS_DAC_SCALE2_S)
#define SENS_DAC_SCALE2_V  0x00000003
#define SENS_DAC_SCALE2_S  18

/* SENS_DAC_SCALE1 : RW; bitpos: [17:16]; default: 0;
 * 00: no scale  01: scale to 1/2  10: scale to 1/4  scale to 1/8
 */

#define SENS_DAC_SCALE1    0x00000003
#define SENS_DAC_SCALE1_M  (SENS_DAC_SCALE1_V << SENS_DAC_SCALE1_S)
#define SENS_DAC_SCALE1_V  0x00000003
#define SENS_DAC_SCALE1_S  16

/* SENS_DAC_DC2 : RW; bitpos: [15:8]; default: 0;
 * DC offset for DAC2 CW generator
 */

#define SENS_DAC_DC2    0x000000ff
#define SENS_DAC_DC2_M  (SENS_DAC_DC2_V << SENS_DAC_DC2_S)
#define SENS_DAC_DC2_V  0x000000ff
#define SENS_DAC_DC2_S  8

/* SENS_DAC_DC1 : RW; bitpos: [7:0]; default: 0;
 * DC offset for DAC1 CW generator
 */

#define SENS_DAC_DC1    0x000000ff
#define SENS_DAC_DC1_M  (SENS_DAC_DC1_V << SENS_DAC_DC1_S)
#define SENS_DAC_DC1_V  0x000000ff
#define SENS_DAC_DC1_S  0

