apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_sens.h
/* SENS_SAR_MEAS_CTRL2_REG register */

#define SENS_SAR_MEAS_CTRL2_REG (DR_REG_SENS_BASE + 0xa0)

/* SENS_AMP_SHORT_REF_GND_FORCE : RW; bitpos: [18:17]; default: 0; */

#define SENS_AMP_SHORT_REF_GND_FORCE    0x00000003
#define SENS_AMP_SHORT_REF_GND_FORCE_M  (SENS_AMP_SHORT_REF_GND_FORCE_V << SENS_AMP_SHORT_REF_GND_FORCE_S)
#define SENS_AMP_SHORT_REF_GND_FORCE_V  0x00000003
#define SENS_AMP_SHORT_REF_GND_FORCE_S  17

/* SENS_AMP_SHORT_REF_FORCE : RW; bitpos: [16:15]; default: 0; */

#define SENS_AMP_SHORT_REF_FORCE    0x00000003
#define SENS_AMP_SHORT_REF_FORCE_M  (SENS_AMP_SHORT_REF_FORCE_V << SENS_AMP_SHORT_REF_FORCE_S)
#define SENS_AMP_SHORT_REF_FORCE_V  0x00000003
#define SENS_AMP_SHORT_REF_FORCE_S  15

/* SENS_AMP_RST_FB_FORCE : RW; bitpos: [14:13]; default: 0; */

#define SENS_AMP_RST_FB_FORCE    0x00000003
#define SENS_AMP_RST_FB_FORCE_M  (SENS_AMP_RST_FB_FORCE_V << SENS_AMP_RST_FB_FORCE_S)
#define SENS_AMP_RST_FB_FORCE_V  0x00000003
#define SENS_AMP_RST_FB_FORCE_S  13

/* SENS_SAR2_RSTB_FORCE : RW; bitpos: [12:11]; default: 0; */

#define SENS_SAR2_RSTB_FORCE    0x00000003
#define SENS_SAR2_RSTB_FORCE_M  (SENS_SAR2_RSTB_FORCE_V << SENS_SAR2_RSTB_FORCE_S)
#define SENS_SAR2_RSTB_FORCE_V  0x00000003
#define SENS_SAR2_RSTB_FORCE_S  11

/* SENS_SAR_RSTB_FSM_IDLE : RW; bitpos: [10]; default: 0; */

#define SENS_SAR_RSTB_FSM_IDLE    (BIT(10))
#define SENS_SAR_RSTB_FSM_IDLE_M  (SENS_SAR_RSTB_FSM_IDLE_V << SENS_SAR_RSTB_FSM_IDLE_S)
#define SENS_SAR_RSTB_FSM_IDLE_V  0x00000001
#define SENS_SAR_RSTB_FSM_IDLE_S  10

/* SENS_XPD_SAR_FSM_IDLE : RW; bitpos: [9]; default: 0; */

#define SENS_XPD_SAR_FSM_IDLE    (BIT(9))
#define SENS_XPD_SAR_FSM_IDLE_M  (SENS_XPD_SAR_FSM_IDLE_V << SENS_XPD_SAR_FSM_IDLE_S)
#define SENS_XPD_SAR_FSM_IDLE_V  0x00000001
#define SENS_XPD_SAR_FSM_IDLE_S  9

/* SENS_AMP_SHORT_REF_GND_FSM_IDLE : RW; bitpos: [8]; default: 0; */

#define SENS_AMP_SHORT_REF_GND_FSM_IDLE    (BIT(8))
#define SENS_AMP_SHORT_REF_GND_FSM_IDLE_M  (SENS_AMP_SHORT_REF_GND_FSM_IDLE_V << SENS_AMP_SHORT_REF_GND_FSM_IDLE_S)
#define SENS_AMP_SHORT_REF_GND_FSM_IDLE_V  0x00000001
#define SENS_AMP_SHORT_REF_GND_FSM_IDLE_S  8

/* SENS_AMP_SHORT_REF_FSM_IDLE : RW; bitpos: [7]; default: 0; */

#define SENS_AMP_SHORT_REF_FSM_IDLE    (BIT(7))
#define SENS_AMP_SHORT_REF_FSM_IDLE_M  (SENS_AMP_SHORT_REF_FSM_IDLE_V << SENS_AMP_SHORT_REF_FSM_IDLE_S)
#define SENS_AMP_SHORT_REF_FSM_IDLE_V  0x00000001
#define SENS_AMP_SHORT_REF_FSM_IDLE_S  7

/* SENS_AMP_RST_FB_FSM_IDLE : RW; bitpos: [6]; default: 0; */

#define SENS_AMP_RST_FB_FSM_IDLE    (BIT(6))
#define SENS_AMP_RST_FB_FSM_IDLE_M  (SENS_AMP_RST_FB_FSM_IDLE_V << SENS_AMP_RST_FB_FSM_IDLE_S)
#define SENS_AMP_RST_FB_FSM_IDLE_V  0x00000001
#define SENS_AMP_RST_FB_FSM_IDLE_S  6

/* SENS_XPD_SAR_AMP_FSM_IDLE : RW; bitpos: [5]; default: 0; */

#define SENS_XPD_SAR_AMP_FSM_IDLE    (BIT(5))
#define SENS_XPD_SAR_AMP_FSM_IDLE_M  (SENS_XPD_SAR_AMP_FSM_IDLE_V << SENS_XPD_SAR_AMP_FSM_IDLE_S)
#define SENS_XPD_SAR_AMP_FSM_IDLE_V  0x00000001
#define SENS_XPD_SAR_AMP_FSM_IDLE_S  5

/* SENS_SAR1_DAC_XPD_FSM_IDLE : RW; bitpos: [4]; default: 0; */

#define SENS_SAR1_DAC_XPD_FSM_IDLE    (BIT(4))
#define SENS_SAR1_DAC_XPD_FSM_IDLE_M  (SENS_SAR1_DAC_XPD_FSM_IDLE_V << SENS_SAR1_DAC_XPD_FSM_IDLE_S)
#define SENS_SAR1_DAC_XPD_FSM_IDLE_V  0x00000001
#define SENS_SAR1_DAC_XPD_FSM_IDLE_S  4

/* SENS_SAR1_DAC_XPD_FSM : RW; bitpos: [3:0]; default: 3; */

#define SENS_SAR1_DAC_XPD_FSM    0x0000000f
#define SENS_SAR1_DAC_XPD_FSM_M  (SENS_SAR1_DAC_XPD_FSM_V << SENS_SAR1_DAC_XPD_FSM_S)
#define SENS_SAR1_DAC_XPD_FSM_V  0x0000000f
#define SENS_SAR1_DAC_XPD_FSM_S  0

/* SENS_SAR_NOUSE_REG register */

#define SENS_SAR_NOUSE_REG (DR_REG_SENS_BASE + 0xf8)

/* SENS_SAR_NOUSE : RW; bitpos: [31:0]; default: 0; */

#define SENS_SAR_NOUSE    0xffffffff
#define SENS_SAR_NOUSE_M  (SENS_SAR_NOUSE_V << SENS_SAR_NOUSE_S)
#define SENS_SAR_NOUSE_V  0xffffffff
#define SENS_SAR_NOUSE_S  0

/* SENS_SARDATE_REG register */

#define SENS_SARDATE_REG (DR_REG_SENS_BASE + 0xfc)

/* SENS_SAR_DATE : RW; bitpos: [27:0]; default: 23089536; */

#define SENS_SAR_DATE    0x0fffffff
#define SENS_SAR_DATE_M  (SENS_SAR_DATE_V << SENS_SAR_DATE_S)
#define SENS_SAR_DATE_V  0x0fffffff
#define SENS_SAR_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_SENS_H */
